{
    "Anhul barberry": {
      "scientific_name": "Berberis anhulensis",
      "other_info": "The Anhul barberry is known for its vibrant red berries, which are used in traditional medicine for their antioxidant properties."
    },
    "Beale barberry": {
      "scientific_name": "Berberis bealei",
      "other_info": "Beale barberry is an evergreen shrub that is native to China and is commonly used in landscaping for its ornamental appeal."
    },
    "Bigfruited holly": {
      "scientific_name": "Ilex macrocarpa",
      "other_info": "The Bigfruited holly produces large, bright red berries that are a food source for various wildlife species in its habitat."
    },
    "Camphor": {
      "scientific_name": "Cinnamomum camphora",
      "other_info": "Camphor trees are known for their distinctive aroma due to the presence of camphor oil, which has various medicinal and industrial uses."
    },
    "Canadian poplar": {
      "scientific_name": "Populus x canadensis",
      "other_info": "The Canadian poplar, also known as the cottonwood tree, is famous for its cotton-like seeds that are dispersed by the wind."
    },
    "Castor aralia": {
      "scientific_name": "Kalopanax septemlobus",
      "other_info": "Castor aralia, a deciduous tree, is native to East Asia and is known for its large, lobed leaves and spiny stems."
    },
    "Chinese cinnamon": {
      "scientific_name": "Cinnamomum cassia",
      "other_info": "Chinese cinnamon is a spice tree known for its aromatic bark, which is used in culinary and medicinal applications."
    },
    "Chinese horse chestnut": {
      "scientific_name": "Aesculus chinensis",
      "other_info": "The Chinese horse chestnut produces distinctive conker seeds and is often planted for its decorative value."
    },
    "Chinese redbud": {
      "scientific_name": "Cercis chinensis",
      "other_info": "Chinese redbud is a small tree valued for its striking pink to purple flowers that bloom in early spring."
    },
    "Chinese Toon": {
      "scientific_name": "Toona sinensis",
      "other_info": "Chinese Toon is famous for its edible young leaves, often used in Chinese cuisine."
    },
    "Chinese tulip": {
      "scientific_name": "Liriodendron chinense",
      "other_info": "The Chinese tulip tree, with its tulip-shaped flowers, is a remarkable ornamental tree."
    },
    "Crepe myrtle": {
      "scientific_name": "Lagerstroemia indica",
      "other_info": "Crepe myrtle is known for its colorful and crepe-like flowers that adorn the tree in summer."
    },
    "Deodar": {
      "scientific_name": "Cedrus deodara",
      "other_info": "Deodar is a type of cedar tree known for its majestic and aromatic wood."
    },
    "Ford Woodlotus": {
      "scientific_name": "Lotus fordii",
      "other_info": "Ford Woodlotus is a small flowering tree with attractive, fragrant flowers."
    },
    "Gingko": {
      "scientific_name": "Ginkgo biloba",
      "other_info": "The Gingko tree is considered a living fossil and is known for its fan-shaped leaves."
    },
    "Glossy privet": {
      "scientific_name": "Ligustrum lucidum",
      "other_info": "Glossy privet is an evergreen tree with glossy leaves and is often used for hedging."
    },
    "Goldenrain": {
      "scientific_name": "Koelreuteria paniculata",
      "other_info": "Goldenrain tree is famous for its clusters of yellow flowers and papery seed capsules."
    },
    "Japan arrowwood": {
      "scientific_name": "Viburnum dilatatum",
      "other_info": "Japan arrowwood is known for its ornamental berries and attractive foliage."
    },
    "Japanese cheesewood": {
      "scientific_name": "Pittosporum tobira",
      "other_info": "Japanese cheesewood is an evergreen shrub or small tree with fragrant white flowers."
    },
    "Japanese flowering cherry": {
      "scientific_name": "Prunus serrulata",
      "other_info": "Japanese flowering cherry trees are celebrated for their stunning pink or white blossoms in spring."
    },
    "Japanese maple": {
      "scientific_name": "Acer palmatum",
      "other_info": "Japanese maple trees are prized for their colorful and delicate foliage."
    },
    "Nanmu": {
      "scientific_name": "Phoebe zhennan",
      "other_info": "Nanmu is a valuable hardwood tree used in fine furniture and construction."
    },
    "Oleander": {
      "scientific_name": "Nerium oleander",
      "other_info": "Oleander is a flowering shrub or small tree known for its toxic properties and colorful flowers."
    },
    "Peach": {
      "scientific_name": "Prunus persica",
      "other_info": "Peach trees produce delicious and juicy fruits that are enjoyed around the world."
    },
    "Pubescent bamboo": {
      "scientific_name": "Phyllostachys pubescens",
      "other_info": "Pubescent bamboo is a type of bamboo known for its sturdy culms and versatile uses."
    },
    "Southern magnolia": {
      "scientific_name": "Magnolia grandiflora",
      "other_info": "Southern magnolia trees feature large, fragrant, and showy white flowers."
    },
    "Sweet Osmanthus": {
      "scientific_name": "Osmanthus fragrans",
      "other_info": "Sweet Osmanthus is admired for its highly fragrant flowers, often used in teas and perfumes."
    },
    "Tangerine": {
      "scientific_name": "Citrus reticulata",
      "other_info": "Tangerine trees bear small, easy-to-peel citrus fruits that are sweet and juicy."
    },
    "Trident maple": {
      "scientific_name": "Acer buergerianum",
      "other_info": "Trident maple is a deciduous tree known for its distinctive three-lobed leaves."
    },
    "True indigo": {
      "scientific_name": "Indigofera tinctoria",
      "other_info": "True indigo is a plant known for its blue dye extracted from its leaves and stems."
    },
    "Wintersweet": {
      "scientific_name": "Chimonanthus praecox",
      "other_info": "Wintersweet is valued for its fragrant winter flowers that bloom in the coldest months."
    },
    "Yew": {
      "scientific_name": "Taxus baccata",
      "other_info": "Yew trees are known for their evergreen foliage and the toxic nature of their seeds and leaves."
    }
  }
  